//*----------------------------------------------------------------------------------------------*//
//* PROGRAM-ID                          boa_isolog_script                                        *//
//*----------------------------------------------------------------------------------------------*//
//* DESCRIPTION      :  전사적경주품질과리 에서 사용하는 Log                                     *//
//* CREATE DATE      :  2008 10. 17                                                              *//
//* UPDATE DATE      :  2008 10. 17                                                              *//
//* PROGRAMMER       :  H.j. jeon                                                                *//
//*----------------------------------------------------------------------------------------------*//
/***************************************************************************************************
123456789 123456789 123456789 123456789 123456789 123456789 123456789 123456789 123456789 1234567890
***************************************************************************************************/

/**************************************************************************************************
*  함   수  명				: fce_GetComboDs
*  설       명				: 복수개의 공통 코드를 가져와 outDataset에 넣기 위한 Transaction 수행
*  param1) oDataSet         : 공통 코드 그룹아이디 목록을 가지고 있는 DataSet (dsInComCd)
*  return Type				: 해당 없음
*  return 내용				: 해당 없음
**************************************************************************************************/
function fce_insertIsoLog(mn_id,team_cd) {

    dsLog.addRow();
	dsLog.SetColumn(0,"MENU_ID",mn_id);
	dsLog.SetColumn(0,"TEAM_CD",team_cd);
	
	var	sServiceName = "e08020008-service:saveIsoLog";         // 서버에 요청할 Sevice 명
	var sInDataSet   = "dsLog=dsLog:u " ;     // Input DataSet 명칭
	var sOutDataSet  = "dsLog=dsLog " ;     // Output DataSet 명칭

	fce_SendTransaction(sServiceName, sInDataSet, sOutDataSet, "fcCallBack", false);
}